# Create2DObjShadow

## Description
Create a shadow representation of the given 2D object at the specified offset vector.

```pascal
FUNCTION Create2DObjShadow(
				h         : HANDLE;
				offsetVec : REAL) : HANDLE;
```

```python

def vs.Create2DObjShadow(h, offsetVec):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to a 2D object.|
|offsetVec|REAL|Shadow direction and length.|

## Version
Availability: from Vectorworks 2014
## Category
* Objects - 2D